docs/java.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-01-02 Tue 14:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jethro Kuan">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/normalize/7.0.0/normalize.css" />
<link rel="stylesheet" href="./css/orgmin.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5ab26c7">1. Hash Table</a>
<ul>
<li><a href="#org70b2671">1.1. Long</a></li>
<li><a href="#orgb2c1851">1.2. String</a></li>
</ul>
</li>
<li><a href="#org3d66fef">2. Add vs Offer</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5ab26c7" class="outline-2">
<h2 id="org5ab26c7"><span class="section-number-2">1</span> Hash Table</h2>
<div class="outline-text-2" id="text-1">
<p>
Default java implementation:
</p>
<ol class="org-ol">
<li><code>hashCode</code> returns memory location of the object</li>
<li>Every object hashes to a different location</li>
</ol>
</div>
<div id="outline-container-org70b2671" class="outline-3">
<h3 id="org70b2671"><span class="section-number-3">1.1</span> Long</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">public int hashCode() {
    return (int) (value ^ (value &gt;&gt; 32));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2c1851" class="outline-3">
<h3 id="orgb2c1851"><span class="section-number-3">1.2</span> String</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-java">public int hashCode() {
    int h = hash; // only caluclate hash once
    if (h == 0 &amp;&amp; count &gt; 0) { // empty = 0
        int off = offset;
        char val[] = value;
        int len = count;
        for (int i = 0; i &lt; len; i++) {
            h = 31*h + val [off++];
        }
        hash = h;
        }
        return h;
}
</pre>
</div>

<pre class="example">
hash = s[0] * 31^(n-1)
      + s[1] * 32^(n-2)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d66fef" class="outline-2">
<h2 id="org3d66fef"><span class="section-number-2">2</span> Add vs Offer</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://stackoverflow.com/questions/15591431/difference-between-offer-and-add-in-priority-queue-in-java">http://stackoverflow.com/questions/15591431/difference-between-offer-and-add-in-priority-queue-in-java</a>
</p>

<p>
The two functions come from two different interfaces that
PriorityQueue implements:
</p>

<ul class="org-ul">
<li>add() comes from Collection.</li>
<li>offer() comes from Queue.</li>
</ul>

<p>
For a capacity-constrained queue, the difference is that add() always
returns true and throws an exception if it can't add the element,
whereas offer() is allowed to return false if it can't add the
element.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-02 Tue 14:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
